HelloServices_wse.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.dew.org/">
  <soapenv:Header>
  <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <wsse:UsernameToken>
      <wsse:Username>admin</wsse:Username>
      <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">unkeZk4K91VQaDHU1S39nsQO8RE=</wsse:Password>
      <wsse:Nonce>GTUXKXVMamAGX10MSQoEFA==</wsse:Nonce>
      <wsu:Created>2020-04-06T18:38:04Z</wsu:Created>
    </wsse:UsernameToken>
  </wsse:Security>
  </soapenv:Header>
  <soapenv:Body>
  <ws:hello>
    <name>World</name>
  </ws:hello>
  </soapenv:Body>
</soapenv:Envelope>