HelloServices_req.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.dew.org/">
  <soapenv:Header/>
  <soapenv:Body>
    <ws:hello>
      <name>World</name>
    </ws:hello>
  </soapenv:Body>
</soapenv:Envelope>